In [1]:
type("Hello")

str

In [2]:
type(math.pi)

NameError: name 'math' is not defined

In [3]:
import math

In [4]:
type(math.pi)

float

In [5]:
math.pi

3.141592653589793

In [6]:
type(3+7)

int

In [7]:
type(6.0//3.0)

float

In [8]:
type(6/3.0)

float

In [9]:
x,y,z = 'house', 'boat', 'ha'

In [10]:
x+y

'houseboat'

In [11]:
y+x

'boathouse'

In [12]:
z*3

'hahaha'

In [13]:
z*x

TypeError: can't multiply sequence by non-int of type 'str'

In [14]:
x+2

TypeError: can only concatenate str (not "int") to str

In [15]:
y+'2'

'boat2'

In [16]:
base, height = 10, 5

In [18]:
area = 1/2*base*height

In [19]:
area

25.0

In [20]:
k = 7
k += 3
k *= 2
k -= 5
k //= 6

In [21]:
k

2

In [22]:
x=4

In [23]:
type(x)

int

In [24]:
x+=1

In [25]:
type(x)

int

In [26]:
x += 1.0

In [27]:
type(x)

float

In [82]:
import pandas as pd

In [83]:
df = pd.read_csv('messy_data.csv', sep=';', encoding = 'Latin-1')

In [84]:
df.head(2)

,IMBD title ID,Original titlÊ,Release year,Genrë¨,Duration,Country,Content Rating,Director,Unnamed: 8,Income,Votes,Score
0,tt0111161,The Shawshank Redemption,1995-02-10,Drama,142,USA,R,Frank Darabont,NaN,$ 28815245,2.278.845,9.3
1,tt0068646,The Godfather,09 21 1972,"Crime, Drama",175,USA,R,Francis Ford Coppola,NaN,$ 246120974,1.572.674,9.2

In [85]:
df.drop(columns=['IMBD title ID', 'Unnamed: 8'], axis=1, inplace=True)

In [86]:
df.head(2)

,Original titlÊ,Release year,Genrë¨,Duration,Country,Content Rating,Director,Income,Votes,Score
0,The Shawshank Redemption,1995-02-10,Drama,142,USA,R,Frank Darabont,$ 28815245,2.278.845,9.3
1,The Godfather,09 21 1972,"Crime, Drama",175,USA,R,Francis Ford Coppola,$ 246120974,1.572.674,9.2

In [87]:
df.rename(columns={'Original titlÊ':'title', 'Release year':'release_year',
                  'Genrë¨':'genre', 'Content Rating':'content_rating'}, inplace=True)

In [88]:
df.columns = df.columns.str.lower()

In [89]:
df.head(2)

,title,release_year,genre,duration,country,content_rating,director,income,votes,score
0,The Shawshank Redemption,1995-02-10,Drama,142,USA,R,Frank Darabont,$ 28815245,2.278.845,9.3
1,The Godfather,09 21 1972,"Crime, Drama",175,USA,R,Francis Ford Coppola,$ 246120974,1.572.674,9.2

In [90]:
df.shape

(101, 10)

In [91]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           100 non-null    object
 1   release_year    100 non-null    object
 2   genre           100 non-null    object
 3   duration        99 non-null     object
 4   country         100 non-null    object
 5   content_rating  77 non-null     object
 6   director        100 non-null    object
 7   income          100 non-null    object
 8    votes          100 non-null    object
 9   score           100 non-null    object
dtypes: object(10)
memory usage: 8.0+ KB

In [93]:
df.release_year = pd.to_datetime(df.release_year, errors='coerce')

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           100 non-null    object
 1   release_year    97 non-null     datetime64[ns]
 2   genre           100 non-null    object
 3   duration        99 non-null     object
 4   country         100 non-null    object
 5   content_rating  77 non-null     object
 6   director        100 non-null    object
 7   income          100 non-null    object
 8    votes          100 non-null    object
 9   score           100 non-null    object
dtypes: datetime64[ns](1), object(9)
memory usage: 8.0+ KB

In [96]:
df.head(2)

,title,release_year,genre,duration,country,content_rating,director,income,votes,score
0,The Shawshank Redemption,1995-02-10,Drama,142,USA,R,Frank Darabont,$ 28815245,2.278.845,9.3
1,The Godfather,1972-09-21,"Crime, Drama",175,USA,R,Francis Ford Coppola,$ 246120974,1.572.674,9.2

In [149]:
df.duration = df.duration.fillna(0)

In [127]:
df.query('duration == "Nan"')

,title,release_year,genre,duration,country,content_rating,director,income,votes,score
6,Schindler's List,1994-03-11,"Biography, Drama, History",Nan,USA,R,Steven Spielberg,$ 322287794,1.183.248,8.9

In [146]:
df.duration=df.duration.str.replace('-', '0')

In [150]:
sum(df.duration.isnull())

0

In [151]:
df.duration = df.duration.astype(int)

In [152]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           100 non-null    object
 1   release_year    97 non-null     datetime64[ns]
 2   genre           100 non-null    object
 3   duration        101 non-null    int32
 4   country         100 non-null    object
 5   content_rating  77 non-null     object
 6   director        100 non-null    object
 7   income          100 non-null    object
 8    votes          100 non-null    object
 9   score           100 non-null    object
dtypes: datetime64[ns](1), int32(1), object(8)
memory usage: 7.6+ KB

In [153]:
df.head(3)

,title,release_year,genre,duration,country,content_rating,director,income,votes,score
0,The Shawshank Redemption,1995-02-10,Drama,142,USA,R,Frank Darabont,$ 28815245,2.278.845,9.3
1,The Godfather,1972-09-21,"Crime, Drama",175,USA,R,Francis Ford Coppola,$ 246120974,1.572.674,9.2
2,The Dark Knight,2008-07-23,"Action, Crime, Drama",152,US,PG-13,Christopher Nolan,$ 1005455211,2.241.615,9.

In [158]:
df.country.replace({'US':'USA', 'US.':'USA', 'New Zesland':'New Zealand',
                   'NaN':'None', 'Italy1':'Italy'}, inplace=True)

In [160]:
df.country = df.country.replace('New Zeland','New Zealand')

In [163]:
df.country.value_counts()

USA             64
UK              12
Italy            5
Japan            4
New Zealand      3
France           3
South Korea      2
Germany          2
Brazil           1
India            1
Denmark          1
West Germany     1
Iran             1
Name: country, dtype: int64

In [164]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           100 non-null    object
 1   release_year    97 non-null     datetime64[ns]
 2   genre           100 non-null    object
 3   duration        101 non-null    int32
 4   country         100 non-null    object
 5   content_rating  77 non-null     object
 6   director        100 non-null    object
 7   income          100 non-null    object
 8    votes          100 non-null    object
 9   score           100 non-null    object
dtypes: datetime64[ns](1), int32(1), object(8)
memory usage: 7.6+ KB

In [174]:
pd.reset_option('display.max_rows')
df.head(2)

,title,release_year,genre,duration,country,content_rating,director,income,votes,score
0,The Shawshank Redemption,1995-02-10,Drama,142,USA,R,Frank Darabont,$ 28815245,2.278.845,9.3
1,The Godfather,1972-09-21,"Crime, Drama",175,USA,R,Francis Ford Coppola,$ 246120974,1.572.674,9.2

In [176]:
df.drop(13, axis=0, inplace=True)

In [177]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 0 to 100
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           100 non-null    object
 1   release_year    97 non-null     datetime64[ns]
 2   genre           100 non-null    object
 3   duration        100 non-null    int32
 4   country         100 non-null    object
 5   content_rating  77 non-null     object
 6   director        100 non-null    object
 7   income          100 non-null    object
 8    votes          100 non-null    object
 9   score           100 non-null    object
dtypes: datetime64[ns](1), int32(1), object(8)
memory usage: 8.2+ KB

In [179]:
df.content_rating.value_counts()

R            45
PG-13        12
PG           11
G             6
Not Rated     1
Approved      1
Unrated       1
Name: content_rating, dtype: int64

In [184]:
import numpy as np

In [186]:
df.content_rating = df.content_rating.replace(np.NaN, 'Unrated')

In [187]:
df.content_rating.value_counts()

R            45
Unrated      24
PG-13        12
PG           11
G             6
Not Rated     1
Approved      1
Name: content_rating, dtype: int64

In [189]:
df.head(3)

,title,release_year,genre,duration,country,content_rating,director,income,votes,score
0,The Shawshank Redemption,1995-02-10,Drama,142,USA,R,Frank Darabont,$ 28815245,2.278.845,9.3
1,The Godfather,1972-09-21,"Crime, Drama",175,USA,R,Francis Ford Coppola,$ 246120974,1.572.674,9.2
2,The Dark Knight,2008-07-23,"Action, Crime, Drama",152,USA,PG-13,Christopher Nolan,$ 1005455211,2.241.615,9.

In [191]:
df.director.value_counts()

Christopher Nolan                  6
Stanley Kubrick                    5
Alfred Hitchcock                   4
Quentin Tarantino                  4
Sergio Leone                       4
                                  ..
Isao Takahata                      1
Giuseppe Tornatore                 1
Lana Wachowski, Lilly Wachowski    1
Andrew Stanton                     1
Stanley Donen                      1
Name: director, Length: 64, dtype: int64

In [193]:
sum(df.director.isnull())

0

In [194]:
df.income

0         $ 28815245
1        $ 246120974
2       $ 1005455211
3      $ 4o8,035,783
4        $ 222831817
           ...
96       $ 156000000
97        $ 11487676
98        $ 15000000
99        $ 22926076
100        $ 1864182
Name: income, Length: 100, dtype: object

In [197]:
df.income = df.income.str.lstrip('$  ')

In [200]:
df.income = df.income.str.replace(',', '')

In [202]:
df.income = df.income.str.replace('o', '0')

In [207]:
df.income = df.income.astype(np.int64)

In [209]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 0 to 100
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           100 non-null    object
 1   release_year    97 non-null     datetime64[ns]
 2   genre           100 non-null    object
 3   duration        100 non-null    int32
 4   country         100 non-null    object
 5   content_rating  100 non-null    object
 6   director        100 non-null    object
 7   income          100 non-null    int64
 8    votes          100 non-null    object
 9   score           100 non-null    object
dtypes: datetime64[ns](1), int32(1), int64(1), object(7)
memory usage: 8.2+ KB

In [212]:
df.columns = df.columns.str.strip()

In [215]:
df.votes = df.votes.str.replace('.','')

C:\Users\HP\AppData\Local\Temp/ipykernel_13548/3950900010.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df.votes = df.votes.str.replace('.','')

In [218]:
df.votes = df.votes.astype(int)

In [221]:
df.score.value_counts()

8.6       11
8.2        8
8.3        8
8.1        7
8.4        7
8.5        6
7.5        6
7.8        6
8.0        6
7.9        5
7.6        4
7.7        4
7.4        3
8.8        3
8.7        2
8.9        2
9.2        1
8,6        1
8,7e-0     1
8.7.       1
++8.7      1
8:8        1
8..8       1
08.9       1
8,9f       1
9,.0       1
9.         1
9.3        1
Name: score, dtype: int64

In [225]:
df.score.replace({'8,6':'8.6','8,7e-0':'8.7','8.7.':'8.7','++8.7':'8.7',
                     '8:8':'8.8','8..8':'8.8','08.9':'8.9','8,9f':'8.9',
                     '9,.0':'9.0','9.':'9.0'}, inplace=True)

In [231]:
df.score = df.score.astype(float)

In [232]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 0 to 100
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           100 non-null    object
 1   release_year    97 non-null     datetime64[ns]
 2   genre           100 non-null    object
 3   duration        100 non-null    int32
 4   country         100 non-null    object
 5   content_rating  100 non-null    object
 6   director        100 non-null    object
 7   income          100 non-null    int64
 8   votes           100 non-null    int32
 9   score           100 non-null    float64
dtypes: datetime64[ns](1), float64(1), int32(2), int64(1), object(5)
memory usage: 7.8+ KB

In [233]:
df

,title,release_year,genre,duration,country,content_rating,director,income,votes,score
0,The Shawshank Redemption,1995-02-10,Drama,142,USA,R,Frank Darabont,28815245,2278845,9.3
1,The Godfather,1972-09-21,"Crime, Drama",175,USA,R,Francis Ford Coppola,246120974,1572674,9.2
2,The Dark Knight,2008-07-23,"Action, Crime, Drama",152,USA,PG-13,Christopher Nolan,1005455211,2241615,9.0
3,The Godfather: Part II,1975-09-25,"Crime, Drama",220,USA,R,Francis Ford Coppola,408035783,1098714,9.0
4,Pulp Fiction,1994-10-28,"Crime, Drama",0,USA,R,Quentin Tarantino,222831817,1780147,8.9
...,...,...,...,...,...,...,...,...,...,...
96,The Sting,1974-03-21,"Comedy, Crime, Drama",129,USA,PG,George Roy Hill,156000000,236285,7.5
97,Das Boot,1982-03-18,"Adventure, Drama, Thriller",149,West Germany,R,Wolfgang Petersen,11487676,226427,7.5
98,Per qualche dollaro in piÃ¹,1965-12-20,Western,132,Italy,Unrated,Sergio Leone,15000000,226039,7.4
99,Jodaeiye Nader az Simin,2011-10-21,Drama,123,Iran,PG-13,Asghar Farhadi,22926076,214165,7.4
100,Singin' in the Rain,1953-02-05,"Comedy, Musical, Romance",103,USA,Unrated,Stanley Donen,1864182,213152,7.4

In [235]:
df.to_csv('clean_data.csv', index=False)

In [236]:
df = pd.read_csv('fuel.csv')

In [237]:
df

,id,make,model,year,VClass,drive,trans,fuelType,cylinders,displacement,combined fuel efficiency,co2 emission
0,32204,Nissan,GT-R,2013,Subcompact Cars,All-Wheel Drive,Automatic (AM6),Premium Gasoline,6,3.8,18.7389,471
1,32205,Volkswagen,CC,2013,Compact Cars,Front-Wheel Drive,Automatic (AM-S6),Premium Gasoline,4,2.0,25.2227,349
2,32206,Volkswagen,CC,2013,Compact Cars,Front-Wheel Drive,Automatic (S6),Premium Gasoline,6,3.6,20.6716,429
3,32207,Volkswagen,CC 4motion,2013,Compact Cars,All-Wheel Drive,Automatic (S6),Premium Gasoline,6,3.6,19.8774,446
4,32208,Chevrolet,Malibu eAssist,2013,Midsize Cars,Front-Wheel Drive,Automatic (S6),Regular Gasoline,4,2.4,28.6813,310
...,...,...,...,...,...,...,...,...,...,...,...,...
3924,39882,Toyota,Prius Prime,2018,Midsize Cars,Front-Wheel Drive,Automatic (variable gear ratios),Regular Gasoline,4,1.8,54.4329,78
3925,39898,Hyundai,Sonata Hybrid,2018,Midsize Cars,Front-Wheel Drive,Automatic (AM6),Regular Gasoline,4,2.0,41.0000,217
3926,39899,Hyundai,Sonata Hybrid SE,2018,Midsize Cars,Front-Wheel Drive,Automatic (AM6),Regular Gasoline,4,2.0,42.0000,212
3927,39900,Lexus,LS 500,2018,Midsize Cars,Rear-Wheel Drive,Automatic (S10),Premium Gasoline,6,3.4,23.0021,387
3928,39901,Lexus,LS 500 AWD,2018,Midsize Cars,All-Wheel Drive,Automatic (S10),Premium Gasoline,6,3.4,21.3945,417

In [254]:
df.year.value_counts()

2015    671
2017    665
2014    660
2016    658
2018    638
2013    637
Name: year, dtype: int64

In [246]:
df.trans = df.trans.str.split(' ', expand=True)[0]

In [247]:
df.trans.value_counts()

Automatic    3068
Manual        861
Name: trans, dtype: int64

In [248]:
sum(df.trans.isnull())

0

In [249]:
df.make.value_counts()

BMW                  523
Mercedes-Benz        269
Porsche              235
Ford                 218
Chevrolet            212
MINI                 201
Audi                 201
Volkswagen           174
Hyundai              158
Dodge                140
Lexus                125
Kia                  124
Cadillac             118
Toyota               116
Infiniti             108
Honda                101
Jaguar                98
Mazda                 87
Nissan                71
Buick                 66
Subaru                60
Chrysler              58
Lincoln               52
Volvo                 50
Acura                 46
Bentley               45
Mitsubishi            44
Rolls-Royce           42
Maserati              39
Scion                 27
Fiat                  26
Ferrari               23
Genesis               17
Aston Martin          15
Suzuki                13
Roush Performance     10
Lotus                 10
Alfa Romeo             6
Karma                  1
Name: make, dtype: int64

In [250]:
df.model.value_counts()

Camaro            45
Jetta             39
Accord            35
Mustang           32
Focus FWD         28
                  ..
Kizashi S AWD      1
Kizashi AWD        1
G37x               1
IS 350/IS 350C     1
LS 500 AWD         1
Name: model, Length: 769, dtype: int64

In [253]:
df.model.str.strip('AWD')

0                   GT-R
1                     CC
2                     CC
3             CC 4motion
4         Malibu eAssist
              ...
3924         Prius Prime
3925       Sonata Hybrid
3926    Sonata Hybrid SE
3927              LS 500
3928             LS 500
Name: model, Length: 3929, dtype: object